{
    "name": "model",
    "trainable": true,
    "layers": [
        {
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [
                    null,
                    3,
                    2,
                    1
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
        },
        {
            "class_name": "QActivation",
            "config": {
                "name": "q_activation",
                "trainable": true,
                "dtype": "float32",
                "activation": "quantized_relu(4,0)"
            },
            "name": "q_activation",
            "inbound_nodes": [
                [
                    [
                        "input_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "QConv2DBatchnorm",
            "config": {
                "name": "q_conv2d_batchnorm",
                "trainable": true,
                "dtype": "float32",
                "filters": 16,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "HeNormal",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L2",
                    "config": {
                        "l2": 0.0010000000474974513
                    },
                    "shared_object_id": 6
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": {
                    "class_name": "Clip",
                    "config": {
                        "min_value": -2.0,
                        "max_value": 2.0
                    }
                },
                "bias_constraint": {
                    "class_name": "Clip",
                    "config": {
                        "min_value": -2.0,
                        "max_value": 2.0
                    }
                },
                "kernel_quantizer": {
                    "class_name": "quantized_bits",
                    "config": {
                        "bits": 4,
                        "integer": 1,
                        "symmetric": true,
                        "alpha": "auto_po2",
                        "keep_negative": true,
                        "use_stochastic_rounding": false,
                        "qnoise_factor": 1.0
                    }
                },
                "bias_quantizer": {
                    "class_name": "quantized_bits",
                    "config": {
                        "bits": 4,
                        "integer": 1,
                        "symmetric": 1,
                        "alpha": null,
                        "keep_negative": true,
                        "use_stochastic_rounding": false,
                        "qnoise_factor": 1.0
                    }
                },
                "kernel_range": null,
                "bias_range": null,
                "axis": [
                    3
                ],
                "momentum": 0.95,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "ema_freeze_delay": null,
                "folding_mode": "ema_stats_folding"
            },
            "name": "q_conv2d_batchnorm",
            "inbound_nodes": [
                [
                    [
                        "q_activation",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "QActivation",
            "config": {
                "name": "q_activation_1",
                "trainable": true,
                "dtype": "float32",
                "activation": "quantized_relu(4,0)"
            },
            "name": "q_activation_1",
            "inbound_nodes": [
                [
                    [
                        "q_conv2d_batchnorm",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "QConv2DBatchnorm",
            "config": {
                "name": "q_conv2d_batchnorm_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 16,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "HeNormal",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L2",
                    "config": {
                        "l2": 0.0010000000474974513
                    },
                    "shared_object_id": 6
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": {
                    "class_name": "Clip",
                    "config": {
                        "min_value": -2.0,
                        "max_value": 2.0
                    }
                },
                "bias_constraint": {
                    "class_name": "Clip",
                    "config": {
                        "min_value": -2.0,
                        "max_value": 2.0
                    }
                },
                "kernel_quantizer": {
                    "class_name": "quantized_bits",
                    "config": {
                        "bits": 4,
                        "integer": 1,
                        "symmetric": true,
                        "alpha": "auto_po2",
                        "keep_negative": true,
                        "use_stochastic_rounding": false,
                        "qnoise_factor": 1.0
                    }
                },
                "bias_quantizer": {
                    "class_name": "quantized_bits",
                    "config": {
                        "bits": 4,
                        "integer": 1,
                        "symmetric": 1,
                        "alpha": null,
                        "keep_negative": true,
                        "use_stochastic_rounding": false,
                        "qnoise_factor": 1.0
                    }
                },
                "kernel_range": null,
                "bias_range": null,
                "axis": [
                    3
                ],
                "momentum": 0.95,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "ema_freeze_delay": null,
                "folding_mode": "ema_stats_folding"
            },
            "name": "q_conv2d_batchnorm_1",
            "inbound_nodes": [
                [
                    [
                        "q_activation_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "QActivation",
            "config": {
                "name": "q_activation_2",
                "trainable": true,
                "dtype": "float32",
                "activation": "quantized_relu(4,0)"
            },
            "name": "q_activation_2",
            "inbound_nodes": [
                [
                    [
                        "q_conv2d_batchnorm_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [
                    1,
                    2
                ],
                "padding": "valid",
                "strides": [
                    1,
                    2
                ],
                "data_format": "channels_last"
            },
            "name": "max_pooling2d",
            "inbound_nodes": [
                [
                    [
                        "q_activation_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        }
    ],
    "input_layers": [
        [
            "input_1",
            0,
            0
        ]
    ],
    "output_layers": [
        [
            "max_pooling2d",
            0,
            0
        ]
    ]
}